Revit 2027 API
ModelCurveArrArray.Insert Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Insert(
	ModelCurveArray item,
	int index
)
Public Overridable Sub Insert (
	item As ModelCurveArray,
	index As Integer
)
public:
virtual void Insert(
	ModelCurveArray^ item,
	int index
)
abstract Insert :
        item : ModelCurveArray *
        index : int -> unit
override Insert :
        item : ModelCurveArray *
        index : int -> unit
Parameters
item ModelCurveArray
index Int32
See Also
Reference
ModelCurveArrArray Class
Autodesk.Revit.DB Namespace